Documents/ДвижениеДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ДвижениеДенег</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Биржа</xr:Item>
				<xr:Item>AccumulationRegister._ВзаиморасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.НезакрытыеДокументы</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоИнвойсам</xr:Item>
				<xr:Item>AccumulationRegister.РасходыДоходы</xr:Item>
				<xr:Item>AccumulationRegister.Зарплата</xr:Item>
				<xr:Item>AccumulationRegister.Деньги</xr:Item>
				<xr:Item>AccumulationRegister.Подотчет</xr:Item>
				<xr:Item>AccumulationRegister.ВКД_ПоступлениеСписаниеДС</xr:Item>
				<xr:Item>AccumulationRegister.ПартииВалюты</xr:Item>
				<xr:Item>AccumulationRegister.Инвестиции</xr:Item>
				<xr:Item>AccumulationRegister.Долги</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПривязано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПривязаноИнвойсов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДенежныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриходРасход</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПриходРасход</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияДенег</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубДСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДенежныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцЗП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубДВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубДКурс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубДОбратный</Name>
					<Comment>Обратный расчет (от конечной суммы)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубДСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корреспонденция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсПартии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентИнвестиций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Затрата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьСреднийКурс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Привязки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КроссКурс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Док2</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбратныйКурс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПредоплата</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Инвойсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инвойс</Name>
							<Type>
								<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>сумма в валюте инвойса</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Comment>Сумма оплаты (в валюте текущего документа)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКР</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеПересчитыватьПриходТовара</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидДвиженияДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидДвиженияДенег</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупатели</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инвестиции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Биржа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Логистика</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Валюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Валюты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Обозначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Копейки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Comment>удалить</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяВалюта</Name>
					<Comment>Курс считается отностительно базовой валюты</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветРГБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Символ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВИнвойсах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВОплатах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиПартионныйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбратныйКурс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодISO</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ДвижениеДенег/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СобытияФормы
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяДокумента = Объект.Ссылка.Метаданные().Синоним;
	
	//Если гоНПЗ(Параметры.ЗначениеКопирования) Тогда Сообщить("Копирование движений денег запрещено!"); Отказ = Истина; Возврат; КонецЕсли; 
	
	РежимЗаписиПроведение = Новый Структура ("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	
	Избранный = гоИзбранный(Объект.Ссылка);
	
	Попытка
		Элементы.ФормаИзменитьФорму.Видимость = Ложь;
	Исключение
	КонецПопытки; 
	
	//2017.03.22
	Мас = ОбщегоНазначенияПовтИсп.МассивДоступныхКасс();
	Если Мас.Количество() <> 0 Тогда 
	Если Мас.Найти(Объект.ДСчет) = Неопределено Тогда Отказ = Истина; Возврат; КонецЕсли; КонецЕсли;  
	
	// © Primus1C  29.07.2023  НАЧАЛО ►  
	
	ВалютаДол = ПараметрыСеанса.БазоваяВалюта;
	
	Элементы.ГруппаСостояние.Видимость 	= ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОтображатьСостояниеВФормеДокумента");
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 

	Элементы.Валюта.БыстрыйВыбор 		= ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("БыстрыйВыборВалют"); 
	Элементы.СубДВалюта.БыстрыйВыбор 	= ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("БыстрыйВыборВалют"); 

	//Элементы.ИнвойсыСумма.Заголовок = СтрШаблон("Сумма (%1)", ПараметрыСеанса.БазоваяВалюта.Символ);
	//Элементы.ИнвойсыСуммаОплаты.Заголовок = СтрШаблон("Сумма (%1)", Объект.Валюта.Символ);
	
	ЗаполнитьКэшДанных(); 
	
	РассчитатьСредневзвешенныйКурс();
	ОтобразитьСтатусыПроведения();
	
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//клФормаДокументаПриОткрытии(ЭтаФорма, Объект);
	
	Если НЕ ЗначениеЗаполнено(Объект.ДСчет) Тогда клОшибка("Не задана текущая касса!"); Отказ = Истина; Возврат; КонецЕсли; 
	
	ТолПро = ЭтаФорма.ТолькоПросмотр;
	
	//2016.08.26
	//этоЧужой = Ложь;
	//Если НЕ Объект.Ссылка.Пустая() Тогда 
	//	этоЧужой = гоЧужойДокумент(Объект.КемСоздан);
	//КонецЕсли; 
	
	//2016.08.26 + ИЛИ этоЧужой
	Если Избранный 
		//ИЛИ этоЧужой 
		Тогда ТолПро = Истина КонецЕсли;
	
	ЭтаФорма.ТолькоПросмотр = ТолПро;
	стрПросмотр = клПросмотр(ЭтаФорма, Избранный, Объект.Ссылка);
	
	// © Primus1C  08.11.2023  НАЧАЛО ►
	ОтобразитьЦветВалюты();   
	Элементы.ИнфоДок.Заголовок = "";  
	ОтобразитьИконкуПартионногоУчета(Объект.ДСчет, Элементы.ДекорацияПартУчетДСчет);
	ОтобразитьИконкуПартионногоУчета(Объект.СубДСчет, Элементы.ДекорацияПартУчетСубДСчет);
	// © Primus1C  ОКОНЧАНИЕ ◄    
	
	УстановитьВидимостьДоступность();
	ОтобразитьДолгиИнвойсов();  
	УстановитьЗаголовокЗакладкиИнвойсы();
	МоиИтоги(); 

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи) 
	
	//клФормаДокументаПередЗаписью(Объект, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)  
	
	// © Primus1C  06.07.2023  НАЧАЛО ►
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента);
	// © Primus1C  ОКОНЧАНИЕ ◄
	УстановитьВидимостьДоступность();
	МоиОстатки();
	МоиИтоги(); 
	
КонецПроцедуры

#КонецОбласти 


#Область СобытияШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	РассчитатьСредневзвешенныйКурс();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДвиженияДенегПриИзменении(Элемент)
	УстановитьВидимостьДоступность(Истина); 
	ОтобразитьДолгиИнвойсов();
КонецПроцедуры
 
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)

	Если гоПЗ(Объект.Контрагент) Тогда Возврат КонецЕсли;
	Если омСервер.ЕстьНезакрытыеДокументы(Объект.Контрагент, Объект.Ссылка) Тогда 
		клВнимание(НСтр("ru = 'ВНИМАНИЕ! Есть незакрытые документы!!!'; en = 'ATTENTION! There are unclosed documents!!!'")) 
	КонецЕсли;     
	
	Если этоПоставщикиПоИнвойсам Тогда
		масВалют = ДругиеВалютыИвойсовКонтрагента();
		Если масВалют.Количество() = 0 Тогда
			Объект.СубДВалюта = ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка");	
		Иначе	
		    Объект.СубДВалюта = масВалют[0];
		КонецЕсли;
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ДСчетПриИзменении(Элемент)

	ОтобразитьИконкуПартионногоУчета(Объект.ДСчет, Элементы.ДекорацияПартУчетДСчет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	УстановитьВидимостьКурсаОплатыИнвойсов();
	ОтобразитьЦветВалюты();
	ПересчитатьСуммуСКонтролемКурса();

КонецПроцедуры

&НаКлиенте
Процедура ИскатьКонтрагента(Команда)
	клИскатьКонтрагента(Новый ОписаниеОповещения("ИскатьКонтрагентаЗавершение", ЭтотОбъект), Объект.Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура ИскатьКонтрагентаЗавершение(НовКон, ДопПараметры) Экспорт
	Если НовКон = Неопределено Тогда Возврат КонецЕсли; 
	Объект.Контрагент = новКон;
КонецПроцедуры
 
&НаКлиенте
Процедура ЗатратаПриИзменении(Элемент) 
	СтатьяЗатраты = СтатьяЗатраты(Объект.Затрата);
	Если НЕ ЗначениеЗаполнено(Объект.Статья) Тогда
		Объект.Статья = СтатьяЗатраты;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СтатьяЗатраты(Затр)

	Возврат Затр.Статья;	

КонецФункции // ()

&НаКлиенте
Процедура Установить(Команда)
	Если Объект.Окончательно Тогда Возврат КонецЕсли;
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	
	//2015.11.22 
	//Отказ = "";
	Если Объект.Сумма = 0 И НЕ ЭтоВВодОстатков Тогда клОшибка("Не введена сумма!"); Возврат; КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Валюта) Тогда клОшибка("Не выбрана валюта!"); Возврат; КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ВидДвиженияДенег) Тогда клОшибка("Не выбран вид операции!"); Возврат; КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ПриходРасход) Тогда клОшибка("Не выбран тип операции!"); Возврат; КонецЕсли;
	
	Если этоПокупатели Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда клОшибка("Не заполнен покупатель!"); Возврат; КонецЕсли;
	ИначеЕсли этоПоставщики Тогда  
		Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда клОшибка("Не заполнен поставщик!"); Возврат; КонецЕсли;
	ИначеЕсли этоПеремещение Тогда  
		Если НЕ ЗначениеЗаполнено(Объект.СубДСчет) Тогда клОшибка("Не заполнена касса КУДА!"); Возврат; КонецЕсли;
	ИначеЕсли этоОбменВалюты Тогда  
		Если НЕ ЗначениеЗаполнено(Объект.СубДСчет) Тогда клОшибка("Не заполнена касса КУДА!"); Возврат; КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.СубДВалюта) Тогда клОшибка("Не заполнено В КАКУЮ валюту!"); Возврат; КонецЕсли;
		Если Объект.СубДСумма = 0 Тогда клОшибка("Не посчитана сумма обмена!"); Возврат; КонецЕсли;
	ИначеЕсли этоРасходы Тогда  
		Если НЕ ЗначениеЗаполнено(Объект.Статья) Тогда клОшибка("Не заполнена статья расходов!"); Возврат; КонецЕсли;
		Если гоРеквизит(Объект.Статья, "ВидСтатьи") <> гоПеречисление("ДоходРасход.Расход") Тогда клОшибка("Это не статья расходов!"); Возврат; КонецЕсли;
	ИначеЕсли этоДоходы Тогда  
		Если НЕ ЗначениеЗаполнено(Объект.Статья) Тогда клОшибка("Не заполнена статья доходов!"); Возврат; КонецЕсли;
		Если гоРеквизит(Объект.Статья, "ВидСтатьи") <> гоПеречисление("ДоходРасход.Доход") Тогда клОшибка("Это не статья доходов!"); Возврат; КонецЕсли;
	ИначеЕсли этоПодотчет Тогда  
		Если НЕ ЗначениеЗаполнено(Объект.Сотрудник) Тогда клОшибка("Не заполнен сотрудник (подотчетное лицо)!"); Возврат; КонецЕсли;
	ИначеЕсли этоЗарплата Тогда  
		Если НЕ ЗначениеЗаполнено(Объект.Сотрудник) Тогда клОшибка("Не заполнен сотрудник!"); Возврат; КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.МесяцЗП) Тогда клОшибка("Не заполнен месяц начисления зарплаты!"); Возврат; КонецЕсли;
	//2016.01.31	
	ИначеЕсли этоВводОстатков Тогда  
		
	КонецЕсли; 
	
	//Если клНетДа(НСтр("ru = 'Установить флаг <Окончательно>?'; en = 'Set flag <Finaly>?'")) Тогда Возврат КонецЕсли;
	//
	//Объект.Окончательно = Истина;
	//МояЗаписать(Ложь);
	//
	//Если Объект.ВидДвиженияДенег = ПредопределенноеЗначение("Перечисление.ВидДвиженияДенег.ОбменВалюты") Тогда
	//	доп = СтрШаблон(", в %1 %2, курс %3, КР %4",
	//	               Формат(Объект.СубДСумма,"ЧДЦ=2"),
	//				   Объект.СубДВалюта,
	//                   Объект.СубдКурс,
	//				   Формат(Объект.СуммаКР,"ЧДЦ=2"));
	//Иначе
	//	доп = "";	
	//КонецЕсли;
	//гоЗаписьЖурналаРегистрации(СтрШаблон("Установили (%1, сумма %2 %3%4, (%5))", 
	//									Объект.ВидДвиженияДенег, 
	//									Формат(Объект.Сумма,"ЧДЦ=2"), 
	//									Объект.Валюта,
	//									доп,
	//									СокрЛП(Объект.Корреспонденция)),
	//							ИмяДокумента, 
	//							"Установка {Окончательно}", 
	//							Объект.Ссылка, 2);
	клНетДа(Новый ОписаниеОповещения("УстановитьПослеПодтверждения", ЭтотОбъект), НСтр("ru = 'Установить флаг <Окончательно>?'; en = 'Set flag <Finaly>?'"));
КонецПроцедуры
 
&НаКлиенте
Процедура УстановитьПослеПодтверждения(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Объект.Окончательно = Истина;
	МояЗаписать(Ложь);
	
	Если Объект.ВидДвиженияДенег = ПредопределенноеЗначение("Перечисление.ВидДвиженияДенег.ОбменВалюты") Тогда
		доп = СтрШаблон(", в %1 %2, курс %3, КР %4",
		               Формат(Объект.СубДСумма,"ЧДЦ=2"),
					   Объект.СубДВалюта,
	                   Объект.СубдКурс,
					   Формат(Объект.СуммаКР,"ЧДЦ=2"));
	Иначе
		доп = "";	
	КонецЕсли;
	гоЗаписьЖурналаРегистрации(СтрШаблон("Установили (%1, сумма %2 %3%4, (%5))", 
										Объект.ВидДвиженияДенег, 
										Формат(Объект.Сумма,"ЧДЦ=2"), 
										Объект.Валюта,
										доп,
										СокрЛП(Объект.Корреспонденция)),
								ИмяДокумента, 
								"Установка {Окончательно}", 
								Объект.Ссылка, 2);
КонецПроцедуры

&НаКлиенте
Процедура Снять(Команда)
	Если НЕ Объект.Окончательно Тогда Возврат КонецЕсли; 
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	//не снимать, если есть привязки - это вроде бы выше проверяется, но проверим еще раз
	//Если Объект.Привязки.Количество() > 0 Тогда Возврат КонецЕсли;
	
	//Если клНетДа("Снять флаг <Окончательно>?") Тогда Возврат КонецЕсли;
	//
	//Объект.Окончательно = Ложь;
	//МояЗаписать(Ложь);
	//
	//гоЗаписьЖурналаРегистрации("Сняли", ИмяДокумента, "Снятие {Окончательно}", Объект.Ссылка, 2);
	клНетДа(Новый ОписаниеОповещения("СнятьПослеПодтверждения", ЭтотОбъект), "Снять флаг <Окончательно>?");

КонецПроцедуры

&НаКлиенте
Процедура СнятьПослеПодтверждения(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Объект.Окончательно = Ложь;
	МояЗаписать(Ложь);
	
	гоЗаписьЖурналаРегистрации("Сняли", ИмяДокумента, "Снятие {Окончательно}", Объект.Ссылка, 2);
КонецПроцедуры
	
#КонецОбласти        


#Область ТЧ_Привязки

&НаКлиенте
Процедура ПривязкиПриАктивизацииСтроки(Элемент) 

	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Элементы.ИнфоДок.Заголовок = "";
	Иначе
		Элементы.ИнфоДок.Заголовок = ИнфоСсылка(Элемент.ТекущиеДанные.Док2);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПривязки(Откуда)
	локПривязки = ЗначениеИзСтрокиВнутр(Откуда);
	
	Если Объект.Привязки.Количество() <> 0 Тогда Объект.Привязки.Очистить() КонецЕсли; 
	
	Для Каждого Стр Из локПривязки Цикл
		Если Стр.СуммаДокумента = 0 Тогда Продолжить КонецЕсли;
		
		Нов = Объект.Привязки.Добавить();
		
		Нов.Сумма1 = Стр.СуммаДокумента;
		Нов.Валюта1 = Стр.ВалютаДокумента;
		Нов.Сумма2 = Стр.СуммаДолга;
		Нов.Валюта2 = Стр.ВалютаДолга;
		Нов.КроссКурс = Стр.КроссКурс;
		Нов.ОбратныйКурс = Стр.ОбратныйКурс;
		Нов.Док2 = Стр.Док;
		Нов.Примечание = Стр.Примечание;
		Нов.ЭтоПредоплата = Стр.ЭтоПредоплата;
	КонецЦикла; 
КонецПроцедуры

//&НаКлиенте
//Процедура Привязать(Команда)
//	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
//	Если НЕ Объект.Окончательно Тогда Возврат КонецЕсли;
//	Если гоПЗ(Объект.Контрагент) Тогда Возврат КонецЕсли; 
//	Если гоПЗ(Объект.Валюта) Тогда Возврат КонецЕсли; 
//	
//	локСумма = Объект.Сумма;
//	Если локСумма = 0 Тогда Возврат КонецЕсли; 
//	
//	МояЗаписать(Ложь);
//	
//	Если НЕ Объект.Проведен Тогда клОшибка("Документ не проведен!"); Возврат; КонецЕсли; 
//	
//	Пар = Новый Структура("Док, Привязки, ТолькоПривязки", Объект.Ссылка, Объект.Привязки, 0);
//	
//	Рез = ОткрытьФормуМодально("Обработка.ПривязкаДолгов.Форма.Форма", Пар);
//	Если Рез = Неопределено Тогда Возврат КонецЕсли; 
//	
//	//2015.11.27
//	СохМасПривязки = клПривязкиВМассив(Объект);
//	
//	ЗаполнитьПривязки(Рез.ПривязкиСтрока);
//	
//	МояЗаписать(Ложь);
//	
//	//2015.11.27
//	клОповеститьПривязки(Объект, СохМасПривязки);
//КонецПроцедуры

//&НаКлиенте
//Процедура ОчиститьПривязки(Команда)
//	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
//	Если НЕ Объект.Окончательно Тогда Возврат КонецЕсли;
//	Если гоПЗ(Объект.Контрагент) Тогда Возврат КонецЕсли; 
//	Если гоПЗ(Объект.Валюта) Тогда Возврат КонецЕсли; 
//	Если Объект.Сумма = 0 Тогда Возврат КонецЕсли; 
//	
//	Если Объект.Привязки.Количество() = 0 Тогда Возврат КонецЕсли; 
//	
//	МояЗаписать(Ложь);
//	
//	Если НЕ Объект.Проведен Тогда клОшибка("Документ не проведен!"); Возврат; КонецЕсли; 
//	
//	Если клНетДа("Очистить все привязки (удалить строки)?", , Истина) Тогда Возврат КонецЕсли; 
//	
//	Объект.Привязки.Очистить();
//	
//	МояЗаписать(Ложь);
//КонецПроцедуры


&НаКлиенте
Процедура Привязать(Команда)
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
	Если НЕ Объект.Окончательно Тогда Возврат КонецЕсли;
	Если гоПЗ(Объект.Контрагент) Тогда Возврат КонецЕсли; 
	Если гоПЗ(Объект.Валюта) Тогда Возврат КонецЕсли; 
	
	локСумма = Объект.Сумма;
	Если локСумма = 0 Тогда Возврат КонецЕсли; 
	
	МояЗаписать(Ложь);
	
	Если НЕ Объект.Проведен Тогда клОшибка("Документ не проведен!"); Возврат; КонецЕсли; 
	
	Пар = Новый Структура("Док, Привязки, ТолькоПривязки", Объект.Ссылка, Объект.Привязки, 0);
	
	ОткрытьФорму("Обработка.ПривязкаДолгов.Форма.Форма", Пар, ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("ПривязатьЗавершение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ПривязатьЗавершение(Рез, ДопПараметры) Экспорт
	Если Рез = Неопределено Тогда Возврат КонецЕсли; 
	
	//2015.11.27
	СохМасПривязки = клПривязкиВМассив(Объект);
	
	ЗаполнитьПривязки(Рез.ПривязкиСтрока);
	
	МояЗаписать(Ложь);
	
	//2015.11.27
	клОповеститьПривязки(Объект, СохМасПривязки);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПривязки(Команда)
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
	Если НЕ Объект.Окончательно Тогда Возврат КонецЕсли;
	Если гоПЗ(Объект.Контрагент) Тогда Возврат КонецЕсли; 
	Если гоПЗ(Объект.Валюта) Тогда Возврат КонецЕсли; 
	Если Объект.Сумма = 0 Тогда Возврат КонецЕсли; 
	
	Если Объект.Привязки.Количество() = 0 Тогда Возврат КонецЕсли; 
	
	МояЗаписать(Ложь);
	
	Если НЕ Объект.Проведен Тогда клОшибка("Документ не проведен!"); Возврат; КонецЕсли; 
	
	клНетДа(Новый ОписаниеОповещения("ОчиститьПривязкиЗавершение", ЭтотОбъект), "Очистить все привязки (удалить строки)?", , Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПривязкиЗавершение(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли; 
	
	Объект.Привязки.Очистить();
	
	МояЗаписать(Ложь);
КонецПроцедуры

#КонецОбласти       


#Область ТЧ_Инвойсы
	
&НаКлиенте
Процедура ИнвойсыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	//Если Поле.Имя = "ИнвойсыИнвойс" И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Инвойс) Тогда
	//	СтандартнаяОбработка = Ложь;
	//	ОткрытьЗначение(Элемент.ТекущиеДанные.Инвойс);   
	//КонецЕсли;   

КонецПроцедуры

&НаКлиенте
Процедура ИнвойсыПриИзменении(Элемент)
	
	РаспределитьЗатраты();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвойсыПослеУдаления(Элемент)

	РаспределитьЗатраты();

КонецПроцедуры

&НаКлиенте
Процедура ИнвойсыИнвойсНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//Граница = омСервер.ПолучитьПараметрСеанса("ДатаЗапретаРедактирования");
	//Если ЗначениеЗаполнено(Граница) Тогда
		СтандартнаяОбработка = Ложь;
		
		НастройкиОтбора = Новый НастройкиКомпоновкиДанных;
		
		//ЭлементОтбора = НастройкиОтбора.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Дата"); 
		//ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
		//ЭлементОтбора.ПравоеЗначение = Граница; 
		//ЭлементОтбора.Использование  = Истина;
		
		ЭлементОтбора = НастройкиОтбора.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Контрагент"); 
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Объект.Контрагент; 
		ЭлементОтбора.Использование  = Истина;
		
		ЭлементОтбора = НастройкиОтбора.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТолькоУслуги"); 
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Ложь; 
		ЭлементОтбора.Использование  = Истина;

		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ФиксированныеНастройки", НастройкиОтбора);
		
		ОткрытьФорму("Документ._Инвойс.ФормаВыбора", ПараметрыОткрытия, Элемент);		
		
	//КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура ПривязатьИнвойсы(Команда)
	
	Если Объект.Инвойсы.Количество() = 0 Тогда
		Объект.СуммаПривязаноИнвойсов = 0;
	КонецЕсли;
	
	Если Объект.Сумма = 0 Тогда 
		клОшибка(НСтр("ru = 'Не указана сумма документа!'; en = 'Document amount not specified!'"));
		Возврат; 
	КонецЕсли; 
	
	Если Объект.СубДВалюта = ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка") Тогда
		// оплата в валюте инвойса
		лКурс = 1;
	Иначе
		// оплата в валюте текущего док-та
		лКурс = ?(Объект.СубДКурс = 0, 1, Объект.СубДКурс);	
	КонецЕсли;
	Парам = Новый Структура("Документ, Контрагент, ИнвойсыТЧ, Дата, Валюта, Курс, СуммаКР", 
							Объект, Объект.Контрагент, Объект.Инвойсы, Объект.Дата, Объект.Валюта, лКурс, Объект.СуммаКР);
	
	//Рез = ОткрытьФормуМодально("Документ.ДвижениеДенег.Форма.ФормаВыбораИнвойсов", Парам);

	//Если НЕ ТипЗнч(Рез) = Тип("Массив") Тогда Возврат КонецЕсли; 
	//// Получили данные:
	////		Привязано - в валюте инвойса
	////		ОстатокДолга - в валюте инвойса
	//
	//Для Каждого Эл Из Рез Цикл 
	//	НайдСтроки = Объект.Инвойсы.НайтиСтроки(Новый Структура("Инвойс", Эл.Инвойс)); 
	//	Если НайдСтроки.Количество() = 0 Тогда
	//		СтрокаТЧ = Объект.Инвойсы.Добавить();
	//		СтрокаТЧ.Инвойс = Эл.Инвойс;
	//	Иначе
	//		СтрокаТЧ = НайдСтроки[0];
	//	КонецЕсли;
	//	СтрокаТЧ.СуммаОплаты 				= Эл.Привязано;
	//	СтрокаТЧ.Сумма 						= Эл.Привязано * эл.Курс;
	//	СтрокаТЧ.Долг 						= Эл.ОстатокДолга; 
	//	СтрокаТЧ.НеПересчитыватьПриходТовара = Эл.НеПересчитыватьПриходТовара;
	//	//Если Эл.Сумма = Эл.Остаток Тогда
	//	//	СтрокаТЧ.Состояние = ПредопределенноеЗначение("Перечисление.Долги.НеЗакрыто");
	//	//ИначеЕсли СтрокаТЧ.Долг = 0 Тогда
	//	//	СтрокаТЧ.Состояние = ПредопределенноеЗначение("Перечисление.Долги.Полностью");
	//	//ИначеЕсли СтрокаТЧ.Долг > 0 Тогда
	//	//	СтрокаТЧ.Состояние = ПредопределенноеЗначение("Перечисление.Долги.Частично");
	//	//КонецЕсли;
	//	СтрокаТЧ.Состояние = РаботаСИнвойсами.СостояниеДолга(СтрокаТЧ.СуммаОплаты, гоРеквизит(СтрокаТЧ.Инвойс, "СуммаВВалютеИнвойса"));
	//	СтрокаТЧ.СтатусПроведения = ОбщегоНазначенияСервер.СтатусПроведения(СтрокаТЧ.Инвойс);
	//	
	//КонецЦикла;
	//
	//Объект.СуммаПривязаноИнвойсов = Объект.Инвойсы.Итог("Сумма");
	//МоиИтоги();
	//Модифицированность = Истина;
	ОткрытьФорму("Документ.ДвижениеДенег.Форма.ФормаВыбораИнвойсов", Парам, ЭтотОбъект, , , ,
				Новый ОписаниеОповещения("ПривязатьИнвойсыЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПривязатьИнвойсыЗавершение(Рез, ДопПараметры) Экспорт
	Если НЕ ТипЗнч(Рез) = Тип("Массив") Тогда Возврат КонецЕсли; 
	// Получили данные:
	//		Привязано - в валюте инвойса
	//		ОстатокДолга - в валюте инвойса
	
	Для Каждого Эл Из Рез Цикл 
		НайдСтроки = Объект.Инвойсы.НайтиСтроки(Новый Структура("Инвойс", Эл.Инвойс)); 
		Если НайдСтроки.Количество() = 0 Тогда
			СтрокаТЧ = Объект.Инвойсы.Добавить();
			СтрокаТЧ.Инвойс = Эл.Инвойс;
		Иначе
			СтрокаТЧ = НайдСтроки[0];
		КонецЕсли;
		СтрокаТЧ.СуммаОплаты 				= Эл.Привязано;
		СтрокаТЧ.Сумма 						= Эл.Привязано * эл.Курс;
		СтрокаТЧ.Долг 						= Эл.ОстатокДолга; 
		СтрокаТЧ.НеПересчитыватьПриходТовара = Эл.НеПересчитыватьПриходТовара;
		//Если Эл.Сумма = Эл.Остаток Тогда
		//	СтрокаТЧ.Состояние = ПредопределенноеЗначение("Перечисление.Долги.НеЗакрыто");
		//ИначеЕсли СтрокаТЧ.Долг = 0 Тогда
		//	СтрокаТЧ.Состояние = ПредопределенноеЗначение("Перечисление.Долги.Полностью");
		//ИначеЕсли СтрокаТЧ.Долг > 0 Тогда
		//	СтрокаТЧ.Состояние = ПредопределенноеЗначение("Перечисление.Долги.Частично");
		//КонецЕсли;
		СтрокаТЧ.Состояние = РаботаСИнвойсами.СостояниеДолга(СтрокаТЧ.СуммаОплаты, гоРеквизит(СтрокаТЧ.Инвойс, "СуммаВВалютеИнвойса"));
		СтрокаТЧ.СтатусПроведения = ОбщегоНазначенияСервер.СтатусПроведения(СтрокаТЧ.Инвойс);
		
	КонецЦикла;
	
	Объект.СуммаПривязаноИнвойсов = Объект.Инвойсы.Итог("Сумма");
    МоиИтоги();
	Модифицированность = Истина;
	
КонецПроцедуры


&НаКлиенте
Процедура ОчиститьПривязкиИнвойсов(Команда)

	Объект.Инвойсы.Очистить(); 
	Объект.СуммаПривязаноИнвойсов = 0; 
	Модифицированность = Истина;
    МоиИтоги();
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьСтатусыПроведения()
	
	Для каждого СтрокаТЧ Из Объект.Инвойсы Цикл
		СтрокаТЧ.СтатусПроведения = ОбщегоНазначенияСервер.СтатусПроведения(СтрокаТЧ.Инвойс);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
// Доступно только Разработчику
//
Процедура ИнвойсыСуммаОплатыПриИзменении(Элемент)
	
	ТекДанные = Элементы.Инвойсы.ТекущиеДанные;     
	Если Объект.СубДКурс <> 0 Тогда
		ТекДанные.Сумма = ТекДанные.СуммаОплаты * Объект.СубДКурс;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
// Доступно только Разработчику
//
Процедура ИнвойсыСуммаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Инвойсы.ТекущиеДанные;
	ТекДанные.Состояние = РаботаСИнвойсами.СостояниеДолга(ТекДанные.СуммаОплаты, гоРеквизит(ТекДанные.Инвойс, "СуммаВВалютеИнвойса"));
		
КонецПроцедуры
 
&НаКлиенте
Процедура ИнвойсыСуммаКРПриИзменении(Элемент) 
	
	Объект.СуммаКР = Объект.Инвойсы.Итог("СуммаКР"); 
	
КонецПроцедуры

#КонецОбласти


&НаКлиенте
Процедура ОтобразитьИконкуПартионногоУчета(СчетСсылка, Декорация)
	
	лПартУчет = ВестиПартионныйУчет(СчетСсылка);
	Если лПартУчет.ВестиПартионныйУчет Тогда
		Декорация.Видимость = Истина;	
	    Декорация.Подсказка = "Партионный учет ведется";
		Если лПартУчет.Дата <> Дата(1,1,1) Тогда
			Декорация.Подсказка = Декорация.Подсказка + " с " + Формат(лПартУчет.Дата, "ДФ=dd.MM.yyyy");
		КонецЕсли;
	Иначе
		Декорация.Видимость = Ложь;	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ВестиПартионныйУчет(Счет)
	
	Если ЗначениеЗаполнено(Счет) Тогда
		Если Счет.ВестиПартионныйУчет Тогда
			Если Счет.НачалоПартионногоУчета <= Объект.Дата Тогда
				Возврат Новый Структура("ВестиПартионныйУчет, Дата", Истина, Счет.НачалоПартионногоУчета);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	     
	Возврат Новый Структура("ВестиПартионныйУчет", Ложь);

КонецФункции	
	
&НаКлиенте
Процедура ПересчитатьСуммуСКонтролемКурса(ПоКурсуПользователя = Ложь)
	
	ТекстОшибки = "";
	ПересчитатьСумму(ПоКурсуПользователя, ТекстОшибки);	
	Если ТекстОшибки <> "" Тогда
		Сооб = Новый СообщениеПользователю;		
	    Сооб.Поле = "Объект.СуммаКР";
		Сооб.Текст = ТекстОшибки;
		Сооб.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокЗакладкиИнвойсы()

	Если этоПоставщикиПоИнвойсам Тогда
		Если Объект.Инвойсы.Количество() = 0 Тогда
			Элементы.ГруппаИнвойсы.Заголовок = "Инвойсы (требуется заполнить)";
			Элементы.ГруппаИнвойсы.Картинка = БиблиотекаКартинок.ВниманиеКрасный;
		Иначе
			Элементы.ГруппаИнвойсы.Заголовок = "Инвойсы";
			Элементы.ГруппаИнвойсы.Картинка = Новый Картинка;
		КонецЕсли;		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РаспределитьЗатраты()
	
	Если ЭтоЛогистика Тогда
		ТЧ = Объект.Инвойсы;
		Если ТЧ.Количество() > 0 Тогда
			Для каждого СтрокаТЧ Из ТЧ Цикл
				СтрокаТЧ.Сумма = Объект.Сумма / ТЧ.Количество();
			КонецЦикла;	 
			Ост = Объект.Сумма - ТЧ.Итог("Сумма");
			Если Ост <> 0 Тогда
				ТЧ[ТЧ.Количество()-1].Сумма = ТЧ[ТЧ.Количество()-1].Сумма + Ост;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	УстановитьЗаголовокЗакладкиИнвойсы();

КонецПроцедуры

//&НаКлиенте
//Функция фИтого()
//	локСумма = Объект.Сумма;
//	локИзвне = омСервер.ПривязаноИзвне(Объект.Ссылка);
//	
//	Возврат "Привязано: " + гоСуммаЗнВал(Объект.СуммаПривязано, Объект.Валюта) + ?(локИзвне = 0, "", "     Привязано извне: " + гоСуммаЗнВал(локИзвне, Объект.Валюта)) + гоРС() + "Предоплата: " + гоСуммаЗнВал(локСумма - Объект.СуммаПривязано - локИзвне, Объект.Валюта);

//КонецФункции

//&НаКлиенте
//Функция фОплата()
//	Если НЕ Объект.Ссылка.Пустая() Тогда
//		ЕстьОплата = омСервер.ЕстьОплатаДокумента(Объект.Ссылка);
//		
//		Если ЕстьОплата И (Объект.СуммаПривязано <> 0) Тогда Возврат "ЕСТЬ ОПЛАТА+ПРИВЯЗКА"
//		ИначеЕсли ЕстьОплата Тогда Возврат "Е С Т Ь   О П Л А Т А"
//		ИначеЕсли Объект.СуммаПривязано <> 0 Тогда Возврат "Е С Т Ь   П Р И В Я З К А"
//		КонецЕсли;
//	КонецЕсли; 
//	
//	Возврат "";
//КонецФункции

&НаКлиенте
Процедура МоиИтоги()
	//стрИтого = фИтого();
	//стрОплата = фОплата(); 
	// © Primus1C  18.03.2024  НАЧАЛО ►     
	СтруктураИтогов = омСервер.МоиИтогиФорматированные(Объект, Истина, Ложь);
	Элементы.ДекорацияИтогоПривязки.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначенияСервер.ТекстHTMLВФорматированнуюСтроку(СтруктураИтогов.Итоги)); 
	//Элементы.ДекорацияИтогоИнвойсы.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначения.ТекстHTMLВФорматированнуюСтроку(СтруктураИтогов.ИтогиИнвойсы)); 
	// © Primus1C  ОКОНЧАНИЕ ◄
КонецПроцедуры

&НаКлиенте
Процедура МоиОстатки()
	стрОстатки = "";
КонецПроцедуры

&НаКлиенте
Процедура МояЗаписать(ПроверятьМодифицированность = Истина)
	УстановитьВидимостьДоступность();
	
	Если ПроверятьМодифицированность Тогда
		Если НЕ Модифицированность Тогда Возврат КонецЕсли; КонецЕсли; 
		
	Записать(РежимЗаписиПроведение);
	МоиОстатки();
	МоиИтоги();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность(ОбработатьВидДД = Ложь)
	
	НетСтрок = Объект.Привязки.Количество() = 0;
	ЕстьСтроки = НЕ НетСтрок;
	
	Закрыто = Объект.Окончательно;	
	НеЗакрыто = НЕ Закрыто;
	
	//2015.11.20
	этоПоставщики 				= (Объект.ВидДвиженияДенег = гоПеречисление("ВидДвиженияДенег.Поставщики"));
	этоПокупатели 				= (Объект.ВидДвиженияДенег = гоПеречисление("ВидДвиженияДенег.Покупатели"));
	этоРасходы 					= (Объект.ВидДвиженияДенег = гоПеречисление("ВидДвиженияДенег.Расходы"));
	этоДоходы 					= (Объект.ВидДвиженияДенег = гоПеречисление("ВидДвиженияДенег.Доходы"));
	этоПеремещение 				= (Объект.ВидДвиженияДенег = гоПеречисление("ВидДвиженияДенег.Перемещение"));
	этоОбменВалюты 				= (Объект.ВидДвиженияДенег = гоПеречисление("ВидДвиженияДенег.ОбменВалюты"));
	этоПодотчет 				= (Объект.ВидДвиженияДенег = гоПеречисление("ВидДвиженияДенег.Подотчет"));
	этоЗарплата 				= (Объект.ВидДвиженияДенег = гоПеречисление("ВидДвиженияДенег.Зарплата")); 
	этоИнвестиции 				= Объект.ВидДвиженияДенег = гоПеречисление("ВидДвиженияДенег.Инвестиции");
	этоБиржа 					= Объект.ВидДвиженияДенег = гоПеречисление("ВидДвиженияДенег.Биржа");
	этоЛогистика 				= Объект.ВидДвиженияДенег = гоПеречисление("ВидДвиженияДенег.Логистика"); 
	этоПоставщикиПоИнвойсам 	= Объект.ВидДвиженияДенег = гоПеречисление("ВидДвиженияДенег.Поставщики") И ВзаиморасчетыПоИнвойсам(Объект.Контрагент); 
	//этоПеремещениеСПартионнымУчетом = этоПеремещение 
	//									И омСервер.ПолучитьРеквизит(Объект.ДСчет,"ВестиПартионныйУчет") 
	//									И омСервер.ПолучитьРеквизит(Объект.СубДСчет,"ВестиПартионныйУчет") 
	//									И омСервер.ПолучитьРеквизит(Объект.Валюта,"ВестиПартионныйУчет");
	//2016.01.31
	этоВводОстатков = (Объект.ВидДвиженияДенег = гоПеречисление("ВидДвиженияДенег.ВводОстатков"));
	
	//2015.11.21
	Если ОбработатьВидДД Тогда
		//получается, что приход может бытть достаточно редко
		//2016.01.31 + ИЛИ этоВводОстатков
		Объект.ПриходРасход = ?(этоПокупатели ИЛИ этоДоходы ИЛИ этоВводОстатков ИЛИ этоИнвестиции ИЛИ ЭтоБиржа, 
								гоПеречисление("ПриходРасход.Приход"), 
								гоПеречисление("ПриходРасход.Расход"));
	КонецЕсли; 
	
	//2015.11.20
	//ну и так далее подобные ситуации
	Элементы.Статья.Видимость = этоРасходы ИЛИ этоДоходы ИЛИ этоБиржа ИЛИ этоЛогистика;
	Элементы.ГруппаСубДСчет.Видимость = этоПеремещение ИЛИ этоОбменВалюты;
	Элементы.ГруппаПривязки.Видимость = этоПоставщики ИЛИ этоПокупатели ИЛИ этоЛогистика;
	//2015.11.21
	Элементы.СубДВалюта.Видимость 				= этоОбменВалюты;
	Элементы.СубДКурс.Видимость 				= этоОбменВалюты; 
	УстановитьВидимостьКурсаОплатыИнвойсов();
	Элементы.СубДОбратный.Видимость 			= этоОбменВалюты;
	Элементы.СубДСумма.Видимость 				= этоОбменВалюты;
	//Элементы.РассчитыватьСреднийКурс.Видимость 	= этоОбменВалюты ИЛИ этоПеремещениеСПартионнымУчетом;
	Элементы.РассчитыватьСреднийКурс.Видимость 	= этоОбменВалюты;
	Элементы.Сотрудник.Видимость 				= этоПодотчет ИЛИ этоЗарплата;
	Элементы.МесяцЗП.Видимость 					= этоЗарплата;
	//2015.11.22
	Элементы.ГруппаКонтрагент.Видимость 	= этоПоставщики ИЛИ этоПокупатели ИЛИ этоДоходы ИЛИ этоРасходы ИЛИ этоИнвестиции;  
	//2015.11.23
	Элементы.ГрИтогиОстатки.Видимость 		= этоПоставщики ИЛИ этоПокупатели;
	
	Элементы.ГруппаЛогистика.Видимость 		= этоЛогистика;
	
	//2015.12.08
	Если НЕ гоМенеджер() Тогда  
		//Элементы.ФормаОтчетОборотыПодотчетаОборотыЛица.Видимость = этоПодотчет ИЛИ этоЗарплата;   
		//Если Элементы.Найти("ФормаОтчетОборотыЗарплатыОборотыСотрудника") <> Неопределено Тогда
		//	Элементы.ФормаОтчетОборотыЗарплатыОборотыСотрудника.Видимость = этоПодотчет ИЛИ этоЗарплата;
		//КонецЕсли;
	КонецЕсли; 
	Элементы.ФормаОтчетДолгиДолги.Видимость = этоПоставщики ИЛИ этоПокупатели ИЛИ этоДоходы ИЛИ этоРасходы;
	
	//2015.11.20
	//наоброт, привязывать можно только когда проведено
	Элементы.ПривязкиПривязать.Доступность = Закрыто;
	Элементы.ПривязкиОчиститьПривязки.Доступность = Закрыто;
	
	//2015.12.08 попробуем только по закрыто
	Элементы.Дата.ТолькоПросмотр = Закрыто;		//Объект.Проведен ИЛИ 
	
	Элементы.Сумма.ТолькоПросмотр = ЕстьСтроки ИЛИ Закрыто;
	Элементы.Валюта.ТолькоПросмотр = ЕстьСтроки ИЛИ Закрыто;
	Элементы.Контрагент.ТолькоПросмотр = ЕстьСтроки ИЛИ Закрыто;
	
	//2015.11.21
	//получается, что никогда не нужно будет это задавать, все происходит автоматические
	Элементы.ПриходРасход.ТолькоПросмотр = Истина;	//ЕстьСтроки ИЛИ Закрыто;
	Элементы.ВидДвиженияДенег.ТолькоПросмотр = ЕстьСтроки ИЛИ Закрыто;
	
	//2015.11.21
	Элементы.Статья.ТолькоПросмотр 		= Закрыто;
	Элементы.Сотрудник.ТолькоПросмотр 	= Закрыто;
	Элементы.МесяцЗП.ТолькоПросмотр 	= Закрыто;
	Элементы.СубДСчет.ТолькоПросмотр 	= Закрыто;
	Элементы.СубДВалюта.ТолькоПросмотр 	= Закрыто;
	Элементы.СубДКурс.ТолькоПросмотр 	= Закрыто;  
	Элементы.РассчитыватьСреднийКурс.ТолькоПросмотр = Закрыто;
	//Элементы.СубДОбратный.ТолькоПросмотр = Закрыто;
	//2015.11.22 а это зачем открывать, пусть сумму ровняют курсом
	//Элементы.СубДСумма.ТолькоПросмотр = Закрыто;
	
	Элементы.Установить.Доступность = НеЗакрыто;
	Элементы.Снять.Доступность = Закрыто;      
	
	// © Primus1C  08.11.2023  НАЧАЛО ►
	Элементы.ГруппаКР.Видимость 				= этоОбменВалюты ИЛИ этоПоставщикиПоИнвойсам;
	//Элементы.СуммаКР.ТолькоПросмотр				= НЕ этоПоставщикиПоИнвойсам;
	Элементы.ПроцентИнвестиций.Видимость 		= этоИнвестиции;    
	Элементы.ГруппаНакладные.Видимость 			= НЕ этоЛогистика; 
	Элементы.ГруппаИнвойсы.Видимость 			= этоЛогистика ИЛИ этоПоставщикиПоИнвойсам; 
	Элементы.Затрата.Видимость 					= этоЛогистика;
	Элементы.ГруппаЛогистика.ТолькоПросмотр 	= Закрыто; 
	Элементы.Инвойсы.ТолькоПросмотр 			= Закрыто; 
	Элементы.Затрата.ТолькоПросмотр 			= Закрыто;
	
	Элементы.ГруппаОплатаИнвойсов.ТолькоПросмотр= Закрыто;
	Элементы.ГруппаСреднийКурс.Видимость 		= этоПоставщикиПоИнвойсам 
													И омСервер.ПолучитьРеквизит(Объект.Валюта,"ВестиПартионныйУчет")
													И омСервер.ПолучитьРеквизит(Объект.ДСчет,"ВестиПартионныйУчет");
	Элементы.ИнвойсыДолг.Видимость 				= этоПоставщикиПоИнвойсам;
	Элементы.ИнвойсыСостояние.Видимость 		= этоПоставщикиПоИнвойсам; 
	Элементы.ИнвойсыГруппаПривязка.Видимость	= этоПоставщикиПоИнвойсам;
	
	Если омСервер.ЕстьРоль("Разработка") Тогда
		Элементы.ИнвойсыСумма.ТолькоПросмотр = Ложь; 
		Элементы.ИнвойсыСумма.Доступность = Истина;
		Элементы.ИнвойсыСуммаОплаты.ТолькоПросмотр = Ложь;
		Элементы.ИнвойсыСуммаОплаты.Доступность = Истина;
		Элементы.ИнвойсыСумма.ТолькоПросмотр = Ложь;
		Элементы.ИнвойсыСумма.Доступность = Истина;
	КонецЕсли;                         
	
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

// © Primus1C  29.10.2023  НАЧАЛО ►

&НаКлиенте
Процедура ОтобразитьДолгиИнвойсов()
	
	Если этоПоставщики И гоРеквизит(Объект.Контрагент, "ПривязыватьИнвойсы") Тогда  
		Долги = ОбщегоНазначенияСервер.ДолгиПоставщикуПоИнвойсам(Объект.Контрагент, Объект.Дата);
		
		Долг = "";
		Для каждого эл Из Долги.ПоВалютам Цикл  
			Если Эл.Сумма <> 0 Тогда
				Долг = Долг + Формат(эл.Сумма, "ЧДЦ=2") + " " + эл.Валюта + " ";
			КонецЕсли;
		КонецЦикла;
		Если Долг = "" Тогда
			Долг = НСтр("ru = 'Долг по инвойсам: 0.00'; en = 'Долг по инвойсам: 0.00'")
		Иначе
			Долг = НСтр("ru = 'Долг по инвойсам: '; en = 'Долг по инвойсам: '") + Долг;
		КонецЕсли;
		
        Для каждого эл Из Долги.ПоИнвойсам Цикл
			НайдСтроки = Объект.Инвойсы.НайтиСтроки(Новый Структура("Инвойс",эл.Инвойс)); 
			Если НайдСтроки.Количество() > 0 Тогда
				НайдСтроки[0].Долг = эл.Сумма; 
				НайдСтроки[0].Состояние = эл.СтатусОплатыАвто;
			КонецЕсли;
		КонецЦикла;   
		
		Элементы.Долг.Видимость = Истина;	
	ИначеЕсли этоПокупатели Тогда	
		Элементы.Долг.Видимость = Ложь;	
	Иначе
		Элементы.Долг.Видимость = Ложь;	
	КонецЕсли;
	
	
	
	
	//ДолгиИнвойсов = ДолгиИнвойсов();	

КонецПроцедуры

//&НаСервере
//Функция ДолгиИнвойсов()
//	
//	Для каждого СтрокаТЧ Из Объект.Инвойсы Цикл
//		СтрокаТЧ.Долг = 0;
//		СтрокаТЧ.Состояние = Перечисления.Предоплаты.Неоплачено;
//	КонецЦикла;

//	Запр = Новый Запрос;
//	Запр.УстановитьПараметр("Дата", Объект.Дата);
//	Запр.УстановитьПараметр("", Объект.Инвойсы.Выгрузить(,"Инвойс").ВыгрузитьКолонку(0));	
//	Запр.Текст = "ВЫБРАТЬ
//	             |	СУММА(ВзаиморасчетыОстатки.СуммаОплатыОстаток) КАК СуммаОплатыОстаток,
//	             |	ВзаиморасчетыОстатки.Валюта КАК Валюта,
//	             |	ВзаиморасчетыОстатки.Инвойс КАК Инвойс
//	             |ИЗ
//	             |	РегистрНакопления._ВзаиморасчетыСПоставщиками.Остатки(&Дата, Инвойс В (&Инвойсы)) КАК ВзаиморасчетыОстатки
//	             |
//	             |СГРУППИРОВАТЬ ПО
//	             |	ВзаиморасчетыОстатки.Инвойс,
//	             |	ВзаиморасчетыОстатки.Валюта";
//   Выборка = Запр.Выполнить().Выбрать();
//   Пока Выборка.Следующий() Цикл
//    
//   	
//   
//   КонецЦикла;             
//   
//КонецФункции // ДолгиИнвойсов()
 
&НаСервере
Функция ВзаиморасчетыПоИнвойсам(КонтрагентСсылка)

	Возврат КонтрагентСсылка.ПривязыватьИнвойсы;	

КонецФункции // ВзаиморасчетыПоИнвойсам()

&НаКлиенте
Процедура УстановитьВидимостьКурсаОплатыИнвойсов()

	Если этоПоставщикиПоИнвойсам И ЗначениеЗаполнено(Объект.Валюта) Тогда 
		масВалют = ДругиеВалютыИвойсовКонтрагента(); 
		Если масВалют.Количество() = 0 Тогда
			Элементы.ГруппаОплатаИнвойсов.Видимость = Ложь; 
		Иначе
			Элементы.ГруппаОплатаИнвойсов.Видимость = Истина;
			лВалюты = омСервер.Фрмт(СтрШаблон("%1 / %2", Объект.СубДВалюта, Объект.Валюта), "НАДПИСЬ_ЦВ2");   
			//+
			ЕстьВалютаВИнвойсах = Ложь;
			Для каждого СтрокаТЧ Из Объект.Инвойсы Цикл
			    Если РаботаСИнвойсами.ВалютаИнвойса(СтрокаТЧ.Инвойс) = Объект.Валюта Тогда
					ЕстьВалютаВИнвойсах = Истина; Прервать;
				КонецЕсли;
			КонецЦикла; 
			Если ЕстьВалютаВИнвойсах Тогда
				лВалюты = лВалюты + омСервер.Фрмт(" (курс не используется в привязках инвойсов)", "НАДПИСЬ_ЦВ3");
			КонецЕсли;
			//-
			Элементы.ДекорацияВалютаИнвойсов.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначенияСервер.ТекстHTMLВФорматированнуюСтроку(лВалюты));
		КонецЕсли; 
	ИначеЕсли этоВводОстатков И гоРеквизит(Объект.Валюта, "ВестиПартионныйУчет") Тогда
		лВалюты = омСервер.Фрмт(СтрШаблон("%1 / %2", Объект.Валюта, ВалютаДол), "НАДПИСЬ_ЦВ2"); 
		Элементы.ДекорацияВалютаИнвойсов.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначенияСервер.ТекстHTMLВФорматированнуюСтроку(лВалюты));
		Элементы.ГруппаОплатаИнвойсов.Видимость = Истина;
	Иначе	
		Элементы.ГруппаОплатаИнвойсов.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ИнвойсыСуммаОплаты.Заголовок = СтрШаблон("Сумма (%1)", гоРеквизит(Объект.Валюта, "Символ"));

КонецПроцедуры

&НаСервере
// Возвращает массив валют из инвойсов закупки контрагента, отличающиеся от валюты текущего док-та
//
Функция ДругиеВалютыИвойсовКонтрагента()

	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запр.УстановитьПараметр("Валюта", Объект.Валюта);
	Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ИнвойсЗакупки.Валюта КАК Валюта
	             |ИЗ
	             |	Документ.ИнвойсЗакупки КАК ИнвойсЗакупки
	             |ГДЕ
	             |	ИнвойсЗакупки.Проведен
	             |	И ИнвойсЗакупки.Контрагент = &Контрагент
	             |	И ИнвойсЗакупки.Валюта <> &Валюта";  
	Возврат Запр.Выполнить().Выгрузить().ВыгрузитьКолонку(0);

КонецФункции 

&НаСервере            
//Процедура ПересчитатьСумму() 
Процедура ПересчитатьСумму(ПоКурсуПользователя = Ложь, ТекстОшибки) 
// © Primus1C  ОКОНЧАНИЕ ◄

	// © Primus1C  22.05.2025  НАЧАЛО ►
	Документы.ДвижениеДенег.УстановитьКурсовуюРазницу(Объект, ПоКурсуПользователя);    
	
	РассчитатьСредневзвешенныйКурс();

	ВОЗВРАТ;
	
	
	
	
	
	
	
	// перенесено в модуль менеджера
	
	БазоваяВалютаФирмы = Объект.Фирма.Валюта; // руб
	Если Объект.Валюта = Объект.СубДВалюта Тогда
		лКурс = 1;	  
		
	ИначеЕсли Объект.Валюта	= БазоваяВалютаФирмы Тогда 
		лКурс = омСервер.Курс(Объект.СубДВалюта, Объект.Фирма, Объект.Дата); 
		Объект.СубДОбратный = Истина;   
		
	ИначеЕсли Объект.СубДВалюта	= БазоваяВалютаФирмы Тогда
		лКурс = омСервер.Курс(Объект.Валюта, Объект.Фирма, Объект.Дата); 
		Объект.СубДОбратный = Ложь;   

	ИначеЕсли Объект.СубДВалюта.БазоваяВалюта = Объект.Валюта Тогда // пересчет в базовую валюту
		лКурс = омСервер.Курс(Объект.СубДВалюта, Объект.Фирма, Объект.Дата); 
		Объект.СубДОбратный = НЕ Объект.СубДВалюта.ОбратныйКурс;     
		
	ИначеЕсли Объект.Валюта.БазоваяВалюта = Объект.СубДВалюта Тогда //
		лКурс = омСервер.Курс(Объект.Валюта, Объект.Фирма, Объект.Дата);
		Объект.СубДОбратный = Объект.Валюта.ОбратныйКурс; 
		
	Иначе // кросс-курс
		Кур1 = омСервер.Курс(Объект.Валюта, 	Объект.Фирма, Объект.Дата);
		Кур2 = омСервер.Курс(Объект.СубДВалюта, Объект.Фирма, Объект.Дата);
		Если Кур1 < Кур2 Тогда
			лКурс = Окр(Кур2 / Кур1, 5);
			Объект.СубДОбратный = Ложь;
		Иначе
			лКурс = Окр(Кур1 / Кур2, 5);
			Объект.СубДОбратный = Истина;
		КонецЕсли;    
			
			
	КонецЕсли;    
	
	лКурсЭталон = лКурс;
	Если ПоКурсуПользователя Тогда 
		лКурс = Объект.СубДКурс; 
	Иначе	
		Объект.СубДКурс = лКурс;
	КонецЕсли;
	
	Если Объект.СубДОбратный Тогда
		Объект.СубДСумма = Окр(Объект.Сумма / лКурс, 2);
		СуммаЭталон = Окр(Объект.СубДСумма * лКурсЭталон, 2);
	Иначе
		Объект.СубДСумма = Окр(Объект.Сумма * лКурс, 2);
		СуммаЭталон = Окр(Объект.СубДСумма / лКурсЭталон, 2);
	КонецЕсли;
	
	Объект.СуммаКР = СуммаЭталон - Объект.Сумма;

    ВОЗВРАТ;
	
	
	
	
	//Кур1 = омСервер.Курс(Объект.Валюта, 	Объект.Фирма, Объект.Дата);
	//Кур2 = омСервер.Курс(Объект.СубДВалюта, Объект.Фирма, Объект.Дата);
	//
	//Если Объект.СубДВалюта.БазоваяВалюта = Объект.Валюта Тогда
	//	Если Объект.СубДВалюта.ОбратныйКурс Тогда
	//		Объект.СубДОбратный = Ложь;
	//		новСубДКурс 		= Кур2;
	//		Объект.СубДСумма 	= Окр(Объект.Сумма * Кур2, 2);
	//	Иначе
	//		Объект.СубДОбратный = Истина; 
	//		новСубДКурс 		= Кур1;
	//		Объект.СубДСумма 	= Окр(Объект.Сумма * Кур1, 2);
	//	КонецЕсли;
	//ИначеЕсли Объект.Валюта.БазоваяВалюта = Объект.СубДВалюта Тогда
	//	Если Объект.Валюта.ОбратныйКурс Тогда
	//		Объект.СубДОбратный = Истина;
	//		новСубДКурс 		= Кур1;
	//		Объект.СубДСумма 	= Окр(Объект.Сумма / Кур1, 2);
	//	Иначе
	//		Объект.СубДОбратный = Ложь; 
	//		новСубДКурс 		= Кур2;
	//		Объект.СубДСумма 	= Окр(Объект.Сумма / Кур2, 2);
	//	КонецЕсли;
	//Иначе
	//	Сообщить(СтрШаблон("В обмене должна присутствовать валюта %1 или %2!", ВалютаДол, ВалютаРуб));
	//	Возврат;
	//КонецЕсли; 
	//
	//Если НЕ ПоКурсуПользователя Тогда
	//	Объект.СубДКурс =	новСубДКурс;
	//КонецЕсли;
	//
	//
	//Возврат;
	
	// © Primus1C  ОКОНЧАНИЕ ◄
	
	
	Если (Объект.СубДКурс = 0) ИЛИ (Объект.СубДКурс = 1) Тогда
		Кур1 = омСервер.Курс(Объект.Валюта, 	Объект.Фирма, Объект.Дата);
		Кур2 = омСервер.Курс(Объект.СубДВалюта, Объект.Фирма, Объект.Дата);
		
		Если Кур1 = 1 Тогда
			Объект.СубДКурс = Кур2;
			Объект.СубДОбратный = 0;
		ИначеЕсли Кур2 = 1 Тогда
			Объект.СубДКурс = Кур1;
			Объект.СубДОбратный = 1;
		Иначе
			Если Кур1 < Кур2 Тогда
				Объект.СубДКурс = Окр(Кур2 / Кур1, 5);
				Объект.СубДОбратный = 0;
			Иначе
				Объект.СубДКурс = Окр(Кур1 / Кур2, 5);
				Объект.СубДОбратный = 1;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.СубДКурс = 0 Тогда Объект.СубДКурс = 1 КонецЕсли;
		
	Если Объект.СубДОбратный = 1 Тогда
		Объект.СубДСумма = Окр(Объект.Сумма * Объект.СубДКурс, 2);
	Иначе
		Объект.СубДСумма = Окр(Объект.Сумма / Объект.СубДКурс, 2);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СубДВалютаПриИзменении(Элемент)
	// © Primus1C  08.11.2023  НАЧАЛО ►
	ОтобразитьЦветВалюты(); 
	// © Primus1C  ОКОНЧАНИЕ ◄
	ПересчитатьСуммуСКонтролемКурса(); 
КонецПроцедуры

&НаКлиенте
Процедура СубДКурсПриИзменении(Элемент)
	// © Primus1C  29.10.2023  НАЧАЛО ►
	//ПересчитатьСумму(); 
	ПересчитатьСуммуСКонтролемКурса(Истина); 
	// © Primus1C  ОКОНЧАНИЕ ◄
КонецПроцедуры

&НаКлиенте
Процедура СубДОбратныйПриИзменении(Элемент)
	ПересчитатьСуммуСКонтролемКурса();
КонецПроцедуры

&НаКлиенте
Процедура СубДСчетПриИзменении(Элемент)
	ПересчитатьСуммуСКонтролемКурса(); 
	ОтобразитьИконкуПартионногоУчета(Объект.СубДСчет, Элементы.ДекорацияПартУчетСубДСчет);
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	ПересчитатьСуммуСКонтролемКурса();
КонецПроцедуры

&НаКлиенте
Процедура КурсОплатыИнвойсовПриИзменении(Элемент)
	
	Если Объект.СубДКурс = 0 Тогда
		Объект.СубДКурс = РаботаСВалютой.Курс(Объект.СубДВалюта, Объект.Дата, Объект.Фирма);
	КонецЕсли;
	
	Для каждого СтрокаТЧ Из Объект.Инвойсы Цикл
		СтрокаТЧ.СуммаОплаты = СтрокаТЧ.Сумма * Объект.СубДКурс;		
		
	
	КонецЦикла;
	
КонецПроцедуры


// © Primus1C  30.06.2023  НАЧАЛО ►

//&НаСервере
//Функция КроссКурс()
//	
//	лВалютаИз = Объект.Валюта;
//	лВалютаВ  = Объект.СубДВалюта;
//	Если ЗначениеЗаполнено(лВалютаИз) И ЗначениеЗаполнено(Объект.СубДВалюта) Тогда 
//		Если лВалютаИз = ВалютаРуб Тогда
//			лКроссКурс = 1 / омСервер.Курс(Объект.СубДВалюта, Объект.Фирма, Объект.Дата);
//			лОписание = "1 / " + лКроссКурс;
//		ИначеЕсли Объект.СубДВалюта = ВалютаРуб Тогда	
//			лКроссКурс = омСервер.Курс(Объект.СубДВалюта, Объект.Фирма, Объект.Дата);
//			лОписание = "" + лКроссКурс;
//		Иначе
//		
//		КонецЕсли;
//		лКроссКурс = омСервер.Курс(лВалютаИз, Объект.Фирма, Объект.Дата) * омСервер.Курс(лВалютаВ, Объект.Фирма, Объект.Дата);
//	Иначе
//		лКроссКурс = 1;	
//	КонецЕсли;
//	
//	Возврат Новый Структура("Курс, Описание", лКроссКурс, лОписание);
//	
//КонецФункции 

// &НаКлиенте
// Процедура ОбновитьПодсказкуКурса()
//	 
//	П = "";
//	Если Объект.ВидДвиженияДенег = ПредопределенноеЗначение("Перечисление.ВидДвиженияДенег.ОбменВалюты") Тогда
//		Если КроссКурс() = Объект.СубДКурс Тогда
//			П = СтрШаблон("%1 %2", 
//						омСервер.Курс(Объект.Валюта, Объект.Фирма, Объект.Дата),
//						);
//		Иначе
//			П = НСтр("ru = 'Курс установлен вручную'; en = 'Course set manually'");
//		КонецЕсли;
//	КонецЕсли;
//	
//	Элементы.СубДКурс.Подсказка = П;

//КонецПроцедуры

&НаСервере
Процедура РассчитатьСредневзвешенныйКурс()

	Если Объект.Валюта.ВестиПартионныйУчет 
		И Объект.ДСчет.ВестиПартионныйУчет И Объект.Дата >= Объект.ДСчет.НачалоПартионногоУчета
		И Объект.ВидДвиженияДенег = Перечисления.ВидДвиженияДенег.Поставщики Тогда
		
	  	СрКурс = РаботаСВалютой.СредневзвешенныйКурс(Объект.Валюта, Объект.ДСчет, ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка.МоментВремени(), Объект.Дата));

	Иначе                   
		
		СрКурс = 0;

	КонецЕсли;
	
	СредневзвешКурс = СтрШаблон("%1 %2 / %3", Формат(СрКурс,"ЧДЦ=5"), Объект.Валюта.Код, Объект.Валюта.БазоваяВалюта.Код); 

	ФмтСреднийКурс = СтрШаблон("%1 %2 %3 / %4 %5",
							омСервер.Фрмт("Средн.курс:", "НАДПИСЬ_ЦВ2"),
							?(СрКурс = 0, омСервер.Фрмт("не введен", "КРАСНЫЙ_ТЕКСТ"), ""),
							омСервер.Фрмт(Объект.Валюта.Код, "НАДПИСЬ_ЦВ2"),
							омСервер.Фрмт(Объект.Валюта.БазоваяВалюта.Код, "НАДПИСЬ_ЦВ2"), 
							?(СрКурс = 0, омСервер.Фрмт("НЕ ВВЕДЕН", "КРАСНЫЙ_ТЕКСТ"), ""),
							);
	Элементы.ДекорацияСредневзвешКурс.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначенияСервер.ТекстHTMLВФорматированнуюСтроку(ФмтСреднийКурс)); 
	
КонецПроцедуры

 &НаСервере
 Процедура ЗаполнитьКэшДанных()
	 
	 КэшДанных = Новый Структура;
	 КэшДанных.Вставить("РаскрашиватьВалюты", ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("РаскрашиватьВалюты"));
	 КэшДанных.Вставить("ЦветаВалют", ОбщегоНазначенияПовтИсп.ЦветаВалют());
	 
 КонецПроцедуры 
 
&НаКлиенте
Процедура ОтобразитьЦветВалюты() 
	
	Если КэшДанных.РаскрашиватьВалюты Тогда
		Элементы.Валюта.ЦветФона 		= КэшДанных.ЦветаВалют.Получить(Объект.Валюта);    
		Элементы.ВалютаКР1.ЦветФона 	= КэшДанных.ЦветаВалют.Получить(Объект.Валюта);    
		Элементы.СубДВалюта.ЦветФона 	= КэшДанных.ЦветаВалют.Получить(Объект.СубДВалюта);
		Элементы.ВалютаКР2.ЦветФона 	= КэшДанных.ЦветаВалют.Получить(Объект.СубДВалюта);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ИнфоДокНажатие(Элемент)
	ОткрытьЗначение(ИнфоСсылка(Элементы.Привязки.ТекущиеДанные.Док2));
КонецПроцедуры

&НаСервере
Функция ИнфоСсылка(Док)
	
	Если ТипЗнч(Док) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		Возврат Док.ВКД_Инвойс;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	

КонецФункции 
	
&НаКлиенте
Процедура ДолгНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура("Контрагент", Объект.Контрагент);
	ОткрытьФорму("Отчет.ОплатыПоИнвойсам.Форма", Новый Структура("Отбор,СформироватьПриОткрытии", Отбор, Истина), ЭтаФорма);
	
КонецПроцедуры


#Область КомандыРазработчика

&НаКлиенте
Процедура ИзменитьСуммуОплатыИнвойса(Команда)
	
	ТекДанные = Элементы.Инвойсы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда 
		ИДИ = Элементы.Инвойсы.ТекущаяСтрока;
		НовСум = ?(ТекДанные.СуммаОплаты=0, ТекДанные.Сумма, ТекДанные.СуммаОплаты);
		//Если ВвестиЧисло(НовСум, "Сумма " + гоРеквизит(Объект.Валюта, "Символ"), 15, 2) Тогда 
		//	Если Объект.Валюта = РаботаСИнвойсами.ВалютаИнвойса(ТекДанные.Инвойс) Тогда
		//		лКурс = 1
		//	Иначе
		//	 	лКурс = Объект.СубДКурс
		//	КонецЕсли; 
		//	ТекДанные.СуммаОплаты = НовСум;
		//	ТекДанные.Сумма = НовСум * лКурс;	
		//КонецЕсли;  
		ПоказатьВводЧисла(Новый ОписаниеОповещения("ИзменитьСуммуОплатыИнвойсаПослеВвода", ЭтотОбъект, ИДИ), НовСум, "Сумма " + гоРеквизит(Объект.Валюта, "Символ"), 15, 2);
	КонецЕсли;

КонецПроцедуры
    
&НаКлиенте
Процедура ИзменитьСуммуОплатыИнвойсаПослеВвода(НовСум, ИДИ) Экспорт
	Если НовСум = Неопределено Тогда Возврат КонецЕсли;
	
	ТекДанные = Объект.Инвойсы.НайтиПоИдентификатору(ИДИ);
	Если ТекДанные = Неопределено Тогда Возврат КонецЕсли;
	
	Если Объект.Валюта = РаботаСИнвойсами.ВалютаИнвойса(ТекДанные.Инвойс) Тогда
		лКурс = 1
	Иначе
	 	лКурс = Объект.СубДКурс
	КонецЕсли; 
	ТекДанные.СуммаОплаты = НовСум;
	ТекДанные.Сумма = НовСум * лКурс;	
КонецПроцедуры


&НаКлиенте
Процедура ИзменитьКурс(Команда)
	
	лКурс = Объект.СубДКурс;
	//Если ВвестиЧисло(лКурс, "Курс " + гоРеквизит(Объект.Валюта, "Символ"), 11, 6) Тогда 
	//	Объект.СубДКурс = лКурс;
	//КонецЕсли;
	ПоказатьВводЧисла(Новый ОписаниеОповещения("ИзменитьКурсПослеВвода", ЭтотОбъект), лКурс, "Курс " + гоРеквизит(Объект.Валюта, "Символ"), 11, 6);
	
КонецПроцедуры    

&НаКлиенте
Процедура ИзменитьКурсПослеВвода(лКурс, ДопПараметры) Экспорт
	Если лКурс = Неопределено Тогда Возврат КонецЕсли;
	Объект.СубДКурс = лКурс;
КонецПроцедуры



&НаКлиенте
Процедура ИзменитьВалютуИнвойса(Команда)
	
	Вал = Объект.СубДВалюта;
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ИзменитьВалютуИнвойсаПослеВвода", ЭтотОбъект), Вал, "Валюта инвойса " + Объект.СубДВалюта, Тип("СправочникСсылка.Валюты"));
	
КонецПроцедуры 

&НаКлиенте
Процедура ИзменитьВалютуИнвойсаПослеВвода(Вал, ДопПараметры) Экспорт
	Если Вал = Неопределено Тогда Возврат КонецЕсли;
	
	Объект.СубДВалюта = Вал; 
	Объект.СубДКурс = РаботаСВалютой.Курс(Вал, Объект.Дата, Объект.Фирма);
	УстановитьВидимостьКурсаОплатыИнвойсов();
КонецПроцедуры


#КонецОбласти




#Область Неактуально

&НаСервере
Процедура ОтчетСреднийКурсЛокальноНаСервере()
	
	// Очищаем старый результат
	ЭтаФорма.ОтчетКурсыРезультатОтчета.Очистить();
	
	// Вызываем стандартный метод формирования отчета.
	// Так как реквизит формы имеет тип "ОтчетОбъект", 
	// у него есть доступ ко всем процедурам модуля объекта отчета.
	
	ОтчетОбъект = РеквизитФормыВЗначение("ОтчетКурсы");
	
	////////	ОбщегоНазначенияКлиент.УстановитьПараметрВФормеОтчета(ФормаОтчета, "Дата", Объект.Дата);
	////////ОбщегоНазначенияКлиент.УстановитьПараметрВФормеОтчета(ФормаОтчета, "Валюта", Объект.Валюта);

	// Если у вас переопределена ПриКомпоновкеРезультата, 
	// вызываем её вручную или через стандартный механизм:
	ОтчетОбъект.СкомпоноватьРезультат(ЭтаФорма.ОтчетКурсыРезультатОтчета, ЭтаФорма.ОтчетКурсы.ДанныеРасшифровки);
	
	// Если нужно сохранить данные расшифровки для работы двойного клика:
	ПоместитьВоВременноеХранилище(ЭтаФорма.ОтчетКурсы.ДанныеРасшифровки, ЭтаФорма.ДанныеРасшифровки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетСреднийКурсЛокально(Команда)
	ОтчетСреднийКурсЛокальноНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СредневзвешКурсНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаОтчета = ПолучитьФорму("Отчет.СреднийКурс.Форма");
	
	ОбщегоНазначенияКлиент.УстановитьПараметрВФормеОтчета(ФормаОтчета, "Дата", Объект.Дата);
	ОбщегоНазначенияКлиент.УстановитьПараметрВФормеОтчета(ФормаОтчета, "Валюта", Объект.Валюта);
	
	//ФормаОтчета.Элементы.ФормаВарианты.Видимость = Ложь;
	ФормаОтчета.Открыть();
	ФормаОтчета.СкомпоноватьРезультат();  

КонецПроцедуры



//&НаКлиенте
//Процедура ДокументРасчетовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;
//	ПараметрыВвода = Новый Структура("Отбор", Новый Структура("Контрагент, РежимВыбора", Объект.Контрагент, Истина));

//	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораИнвойса", ЭтотОбъект, , "ПриОшибкеВыбора", ЭтотОбъект);
//	ОткрытьФорму("Документ._Инвойс.Форма.ФормаВыбора", ПараметрыВвода,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	//ОткрытьФорму("Документ._Инвойс.Форма.ФормаСписка", ПараметрыВвода,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

//КонецПроцедуры

//&НаКлиенте
//Процедура ПриОшибкеВыбора(Результат, ДопПараметры) Экспорт
//	
//КонецПроцедуры	

//&НаКлиенте
//Процедура ПослеВыбораИнвойса(Результат, ДопПараметры) Экспорт
//	
//	Если Результат <> Неопределено Тогда
//        Объект.ДокументРасчетов = Результат;
//	КонецЕсли;  

//КонецПроцедуры

#КонецОбласти
